app/controllers/events_controller.rb

INSERT INTO "events" ("start_date", "duration", "title", "description", "price", "location", "created_at", "updated_at", "administrator_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    @event.administrator_id = current_user.id

    respond_to do |format|
      if @event.save