app/controllers/users_controller.rb

SELECT "events".* FROM "events" WHERE "events"."administrator_id" = $1  [["administrator_id", 1]]
---
  def show
    @user_futur_events = @user.events
    @user_administrate = Event.where(administrator_id: @user.id)